soapStarter/ConsumerTestScripts/service2.http

#uses httpyac extension
GET http://localhost:5175/weatherforecast 
POST http://localhost:5175/service1 
POST http://localhost:5175/service1 
Content-Type: application/xml 
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://some.com/service/">
    <soap:Header/>
    <soap:Body>
       <ser:GetWeatherForecast/>
    </soap:Body>
</soap:Envelope> 

POST http://localhost:5175/service2
Content-Type: application/xml 
<soap:Envelope
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:ser="http://some.com/service/">
    <soap:Header/>
    <soap:Body>
       <ser:GetWeatherForecast/>
    </soap:Body>
</soap:Envelope> 